podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIOA_STM32F030.svd.xml
            <register>
               <name>ODR</name>
               <description>GPIO port output data register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>ODR0</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR1</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR2</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR3</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR4</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR5</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR6</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR7</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR8</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR9</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR10</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR11</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR12</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR13</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR14</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR15</name>
                     <description>Port output data (y = 0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BSRR</name>
               <description>GPIO port bit set/reset
          register</description>
               <addressOffset>0x18</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>BS0</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS1</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS2</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS3</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS4</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS5</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS6</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS7</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS8</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS9</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS10</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS11</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS12</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS13</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS14</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS15</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR0</name>
                     <description>Port x set bit y (y=0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR1</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR2</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR3</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR4</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR5</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR6</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR7</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR8</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR9</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR10</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR11</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR12</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR13</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR14</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR15</name>
                     <description>Port x reset bit y (y = 0..15)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCKR</name>
               <description>GPIO port configuration lock
          register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>LCK0</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK1</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK2</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK3</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK4</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK5</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK6</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK7</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK8</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK9</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK10</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK11</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK12</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK13</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK14</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK15</name>
                     <description>Port x lock bit y (y=0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCKK</name>
                     <description>Apply Port Lock bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFRL</name>
               <description>GPIO alternate function low
          register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>AFRL0</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL1</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL2</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL3</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL4</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL5</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL6</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL7</name>
                     <description>Alternate function selection for port x bit y (y = 0..7)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFRH</name>
               <description>GPIO alternate function high
          register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>AFRH8</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH9</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH10</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH11</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH12</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH13</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH14</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH15</name>
                     <description>Alternate function selection for port x bit y (y = 8..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
