podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIOA_STM32F030.svd.xml
            <register>
               <name>BRR</name>
               <description>Port bit reset register</description>
               <addressOffset>0x28</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>BR0</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR1</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR2</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR3</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR4</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR5</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR6</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR7</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR8</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR9</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR10</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR11</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR12</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR13</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR14</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR15</name>
                     <description>Port x Reset bit y</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
